# 17. Дан список чисел.
# Определите, сколько в нем встречается различных чисел.
#сделать список из неповторяющихся чисел жлементов

nums = [1, 2, 3, 4, 1, 2]
print(set(nums))